Cinema/src/DataProcessors/ЗагрузкаФильмаСКиноПоискаПоИд/ЗагрузкаФильмаСКиноПоискаПоИд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаФильмаСКиноПоискаПоИд</name>
  <comment>Загрузка одного фильма с &quot;КиноПоиска&quot; по идентификатору</comment>
</mdclass:DataProcessor>

Cinema/src/Catalogs/Фильмы/Фильмы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Фильмы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Афиша</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВФильмотеке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполненКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НужноСкачать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОригинальноеНазвание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПросмотреноВКино</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Формат3D</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойРелиз</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Cinema/src/DataProcessors/ЗагрузкаФильмаСКиноПоискаПоИд/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьСКиноПоиска(Команда)

	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;

	#Если Не ВебКлиент И НЕ МобильныйКлиент Тогда
	АдресСервера  = "www.kinopoisk.ru";
	АдресФильма   = СтрШаблон("/film/%1/", ИдФильма);
	ОтпрЗаголовки = Новый Соответствие;
	
	ОтпрЗаголовки.Вставить("host", АдресСервера);
	
	Попытка
		Соединение	 = Новый HTTPСоединение(АдресСервера, , , , , , Новый ЗащищенноеСоединениеOpenSSL());
		ЗапросХТТП   = Новый HTTPЗапрос(АдресФильма, ОтпрЗаголовки);
		ОтветСервера = Соединение.Получить(ЗапросХТТП);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон(НСтр("ru = 'Ошибка запроса страницы %1; по причине: %2.'"), АдресФильма, ОписаниеОшибки());
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;
	
	СтраницаHTML = ОтветСервера.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	
	Если ОтветСервера.КодСостояния <> 200 Тогда
		Если ПустаяСтрока(СтраницаHTML) Тогда
			СтраницаTXT = СтрШаблон(НСтр("ru = 'Ошибка запроса %1%2; Код ошибки: %3.'"), АдресСервера, АдресФильма, ОтветСервера.КодСостояния);
		Иначе
			СтраницаTXT = УдалитьСодержимоеТэговHTML(СтраницаHTML);
		КонецЕсли;
		ПоказатьПредупреждение( , СтраницаTXT, 60, НСтр("ru = 'Ошибка запроса страницы с сервера'"));
		Возврат;
	КонецЕсли;
	
	РаспарситьФайлHTML(СтраницаHTML);
	
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РаспарситьФайлHTML(ТекущийHTML) Экспорт
	
	КлассИмяФильма       = "class=""moviename-title-wrapper""";
	КлассОригинальноеИмя = "class=""alternativeHeadline""";
	ОкончаниеБлока       = "</span>";
	СтруктураФильма      = Новый Структура;
	
	ЗаполнитьСвойствоФильма(ТекущийHTML, СтруктураФильма, КлассИмяФильма, "Наименование", ОкончаниеБлока);
	ЗаполнитьСвойствоФильма(ТекущийHTML, СтруктураФильма, КлассОригинальноеИмя, "ОригинальноеНазвание", ОкончаниеБлока);
	
	ЗаполнитьАфишуФильма(ТекущийHTML, СтруктураФильма);
	ЗаполнитьДатуВыходаФильма(ТекущийHTML, СтруктураФильма);
	ЗаполнитьГруппуФильмаНаСервере(СтруктураФильма);
	
	Если НЕ ПустаяСтрока(Комментарий) Тогда
		СтруктураФильма.Вставить("Комментарий", Комментарий);
	КонецЕсли;
	
	СтруктураФильма.Вставить("НужноСкачать", НужноСкачать);
	
	Если СтруктураФильма.Свойство("Наименование") Тогда
		ОткрытьФорму("Справочник.Фильмы.ФормаОбъекта", СтруктураФильма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСвойствоФильма(ТекущийHTML, СтруктураФильма, ПодстрокаПоиска, СвойствоФильма, ОкончаниеБлока)

	ПозицияЗнака = СтрНайти(ТекущийHTML, ПодстрокаПоиска);
	
	Если ПозицияЗнака > 0 Тогда
		ПозицияЗнака = СтрНайти(ТекущийHTML, "<", НаправлениеПоиска.СКонца, ПозицияЗнака);
		Если ПозицияЗнака > 0 Тогда
			ВременнаяСтрока = Сред(ТекущийHTML, ПозицияЗнака);
			ПозицияЗнака    = СтрНайти(ВременнаяСтрока, ОкончаниеБлока);
			Если ПозицияЗнака > 0 Тогда
				ВременнаяСтрока = Лев(ВременнаяСтрока, ПозицияЗнака-1);
				ВременнаяСтрока = УдалитьСодержимоеТэговHTML(ВременнаяСтрока);
				Если НЕ ПустаяСтрока(ВременнаяСтрока) Тогда
					СтруктураФильма.Вставить(СвойствоФильма, ВременнаяСтрока);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАфишуФильма(ТекущийHTML, СтруктураФильма)
	
	Перем ПутьКАфише;

	ПозицияЗнака = СтрНайти(ТекущийHTML, "openImgPopup");
	Если ПозицияЗнака > 0 Тогда
		ПозицияЗнака = СтрНайти(ТекущийHTML, "'", , ПозицияЗнака);
		Если ПозицияЗнака > 0 Тогда
			ВременнаяСтрока = Сред(ТекущийHTML, ПозицияЗнака+1);
			ПозицияЗнака    = СтрНайти(ВременнаяСтрока, "'");
			Если ПозицияЗнака > 0 Тогда
				ВременнаяСтрока = Лев(ВременнаяСтрока, ПозицияЗнака-1);
				Если НЕ ПустаяСтрока(ВременнаяСтрока) Тогда
					СтруктураФильма.Вставить("Афиша", ВременнаяСтрока);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ СтруктураФильма.Свойство("Афиша", ПутьКАфише) Тогда
		Возврат;
	КонецЕсли;

#Если ВебКлиент Тогда
	ВременныйФайл = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор) + ".jpg";
#Иначе	
	ВременныйФайл = ПолучитьИмяВременногоФайла();
#КонецЕсли	
	ХранилищеJpeg = "st.kp.yandex.net";
	ХранилищеWebp = "avatars.mds.yandex.net";
	
	Попытка
		Соединение   = Новый HTTPСоединение(ХранилищеJpeg, , , , , , Новый ЗащищенноеСоединениеOpenSSL());
		ОтветСервера = Соединение.Получить(ПутьКАфише, ВременныйФайл);
		Нахождение   = ОтветСервера.Заголовки.Получить("Location");
		Если Нахождение <> Неопределено Тогда
			Соединение   = Новый HTTPСоединение(ХранилищеWebp, , , , , , Новый ЗащищенноеСоединениеOpenSSL());
			Нахождение   = СтрЗаменить(Нахождение, "https://" + ХранилищеWebp, "");
			ОтветСервера = Соединение.Получить(Нахождение, ВременныйФайл);
		КонецЕсли;
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка подключения к сайту; по причине: " + ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;
	
	ТекКартинка = Новый Картинка(ВременныйФайл);

	Если ТекКартинка.Формат() = ФорматКартинки.НеизвестныйФормат Тогда
		АдресВХранилище = ПоместитьВоВременноеХранилище(ТекКартинка, ЭтотОбъект.УникальныйИдентификатор);
		АдресВХранилище = КонвертироватьФайлНаСервере(АдресВХранилище);
		Если ЭтоАдресВременногоХранилища(АдресВХранилище) Тогда
			ТекКартинка = ПолучитьИзВременногоХранилища(АдресВХранилище);
		КонецЕсли;
	КонецЕсли;
	
	СтруктураФильма.Вставить("Афиша", ПоместитьВоВременноеХранилище(ТекКартинка, ЭтотОбъект.УникальныйИдентификатор));
	
	НачатьУдалениеФайлов(, ВременныйФайл);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДатуВыходаФильма(ТекущийHTML, СтруктураФильма)

	Месяцы = Новый Соответствие;
	Месяцы.Вставить("ЯНВАРЯ",  "01");
	Месяцы.Вставить("ФЕВРАЛЯ", "02");
	Месяцы.Вставить("МАРТА",   "03");
	Месяцы.Вставить("АПРЕЛЯ",  "04");
	Месяцы.Вставить("МАЯ",     "05");
	Месяцы.Вставить("ИЮНЯ",    "06");
	Месяцы.Вставить("ИЮЛЯ",    "07");
	Месяцы.Вставить("АВГУСТА", "08");
	Месяцы.Вставить("СЕНТЯБРЯ","09");
	Месяцы.Вставить("ОКТЯБРЯ", "10");
	Месяцы.Вставить("НОЯБРЯ",  "11");
	Месяцы.Вставить("ДЕКАБРЯ", "12");
	
	ПозицияЗнака = СтрНайти(ТекущийHTML, "div_rus_prem_td");
	Если ПозицияЗнака > 0 Тогда
		ПозицияЗнака = СтрНайти(ТекущийHTML, "data-date-premier-start-link", , ПозицияЗнака);
		Если ПозицияЗнака > 0 Тогда
			ВременнаяСтрока = Сред(ТекущийHTML, ПозицияЗнака);
			ПозицияЗнака    = СтрНайти(ВременнаяСтрока, Символ(34));
			Если ПозицияЗнака > 0 Тогда
				ВременнаяСтрока = Сред(ВременнаяСтрока, ПозицияЗнака+1);
				ДатаСтрокой     = "";
				Для ИндексСимвола = 1 По 10 Цикл
					ТекСимвол = Сред(ВременнаяСтрока, ИндексСимвола, 1);
					ТекКодСимвола = КодСимвола(ТекСимвол);
					Если ТекКодСимвола >= 48 И ТекКодСимвола <= 57 Тогда
						ДатаСтрокой = ДатаСтрокой + ТекСимвол;
					Иначе
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если СтрДлина(ДатаСтрокой) = 8 Тогда
					СтруктураФильма.Вставить("ДатаВыхода", Дата(ДатаСтрокой));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ПозицияЗнака = СтрНайти(ТекущийHTML, "digital_release");
		Если ПозицияЗнака > 0 Тогда
			ПозицияЗнака = СтрНайти(ТекущийHTML, "<a", , ПозицияЗнака);
			Если ПозицияЗнака > 0 Тогда
				ВременнаяСтрока = Сред(ТекущийHTML, ПозицияЗнака);
				ПозицияЗнака    = СтрНайти(ВременнаяСтрока, "</a>");
				Если ПозицияЗнака > 0 Тогда
					ВременнаяСтрока = Лев(ВременнаяСтрока, ПозицияЗнака+3);
					ВременнаяСтрока = ВРег(УдалитьСодержимоеТэговHTML(ВременнаяСтрока));
					МассивСтрок     = СтрРазделить(ВременнаяСтрока, " ");
					Если МассивСтрок.Количество() = 3 Тогда
						ТекМесяц = Месяцы.Получить(МассивСтрок.Получить(1));
						ТекДень  = МассивСтрок.Получить(0);
						ТекДень  = ?(СтрДлина(ТекДень) = 1, "0", "") + ТекДень;
						Если ТекМесяц <> Неопределено Тогда
							ДатаСтрокой = МассивСтрок.Получить(2) + ТекМесяц + ТекДень;
							Если СтрДлина(ДатаСтрокой) = 8 Тогда
								СтруктураФильма.Вставить("ДатаВыхода", Дата(ДатаСтрокой));
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция УдалитьСодержимоеТэговHTML(СтрокаHTML, ОткрывающийТэг = "<", ЗакрывающийТэг = ">")

	ВременнаяСтрока = СокрЛП(СтрокаHTML);
	СимволовВСтроке = СтрДлина(ВременнаяСтрока);
	СтрокаВозврата  = "";
	ДобавитьСимвол  = Истина;
	
	Для Сч = 1 По СимволовВСтроке Цикл
		
		ТекСимвол = Сред(ВременнаяСтрока, Сч, 1);
		Если ТекСимвол = ОткрывающийТэг Тогда
			ДобавитьСимвол = Ложь;
			Продолжить;
		ИначеЕсли ТекСимвол = ЗакрывающийТэг Тогда
			ДобавитьСимвол = Истина;
			Продолжить;
		КонецЕсли;
		
		Если ДобавитьСимвол Тогда
			СтрокаВозврата = СтрокаВозврата + ТекСимвол;
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат СтрокаВозврата;

КонецФункции

&НаСервере
Функция КонвертироватьФайлНаСервере(АдресВХранилище)

	Обработки.ЗагрузкаСКиноПоиска.КонвертироватьФайлНаСервере(АдресВХранилище, ЭтотОбъект);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьГруппуФильмаНаСервере(СтруктураФильма)

	Перем ДатаВыхода;
	
	Если СтруктураФильма.Свойство("ДатаВыхода", ДатаВыхода) Тогда
		
		СпрГруппа = Справочники.Фильмы.НайтиПоНаименованию(Формат(ДатаВыхода, "ДФ=yyyy"), Истина);
		
		Если ЗначениеЗаполнено(СпрГруппа) Тогда
			СтруктураФильма.Вставить("Родитель", СпрГруппа);
		КонецЕсли;
		
	Иначе
		
		СтруктураФильма.Вставить("ДатаВыхода", ТекущаяДатаСеанса());
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
